doc/post001_crates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-29 Wed 19:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marco Paolo Valerio Vezzoli" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0463098">1. crates and cargo</a>
<ul>
<li><a href="#org5ec1a00">1.1. a few things about cargo</a>
<ul>
<li><a href="#orged0315c">1.1.1. basic default file layout for cargo</a></li>
<li><a href="#orga5bc51d">1.1.2. compilation target basics</a></li>
<li><a href="#org182a36b">1.1.3. library and tests</a></li>
</ul>
</li>
<li><a href="#orgcd86a3f">1.2. how rust groups code</a>
<ul>
<li><a href="#org9a5ece2">1.2.1. the code hierarchy</a></li>
<li><a href="#orgf92644c">1.2.2. the crate and modules default</a></li>
<li><a href="#orgb9bae1b">1.2.3. use keyword and navigating the crate hierarchy</a></li>
</ul>
</li>
<li><a href="#org2715858">1.3. mixing all together</a>
<ul>
<li><a href="#org9f6b540">1.3.1. other compilation targets</a></li>
<li><a href="#orgc62433b">1.3.2. accessing the default crate from test files</a></li>
<li><a href="#org33ba0d6">1.3.3. accessing modules from different files</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0463098" class="outline-2">
<h2 id="org0463098"><span class="section-number-2">1</span> crates and cargo</h2>
<div class="outline-text-2" id="text-1">
<p>
This post is aimed at collecting some notes for crates usage,
<code>cargo</code> is a fundamental element of this description being the main
toolchain manager
</p>

<p>
This require some knowledge about how cargo works and how rust
groups code: you can find other references in the 7th chapter of the
Rust Book
</p>
</div>
<div id="outline-container-org5ec1a00" class="outline-3">
<h3 id="org5ec1a00"><span class="section-number-3">1.1</span> a few things about cargo</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orged0315c" class="outline-4">
<h4 id="orged0315c"><span class="section-number-4">1.1.1</span> basic default file layout for cargo</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
cargo has a default layout: with the same toml you may expect
</p>
<ul class="org-ul">
<li>a binary project as generated by</li>
</ul>
<pre class="example" id="org525f2fa">
projectname/
|
+- Cargo.toml
|
+- src/
   |
   +- main.rs
</pre>

<ul class="org-ul">
<li>a library project</li>
</ul>
<pre class="example" id="org08e01ec">
projectname/
|
+- Cargo.toml
|
+- src/
   |
   +- lib.rs
</pre>

<p>
in both case you get compilation with
</p>
<div class="org-src-container">
<pre class="src src-bash">cargo build
</pre>
</div>

<p>
while in the binary case you can also run the code with
</p>
<pre class="example">
cargo run
</pre>
</div>
</div>

<div id="outline-container-orga5bc51d" class="outline-4">
<h4 id="orga5bc51d"><span class="section-number-4">1.1.2</span> compilation target basics</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<code>cargo</code> has some commands and options aimed to compile differently the
code and possibly also choose specific output
</p>

<p>
When compiling the code with commands <code>build</code> or <code>run</code> the default
target is <code>dev</code> while production compilation requires the flag
<code>cargo build --release</code>
</p>
</div>
</div>

<div id="outline-container-org182a36b" class="outline-4">
<h4 id="org182a36b"><span class="section-number-4">1.1.3</span> library and tests</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
library example generated by <code>cargo new projectname --lib</code> contains
some test example to start unit testing: looks like this is the
suggested feature
</p>

<div class="org-src-container">
<pre class="src src-rust"><span class="linenr">1: </span><span style="color: #23d7d7;">#[cfg(test)]</span>
<span class="linenr">2: </span><span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">tests</span> {
<span class="linenr">3: </span>    <span style="color: #23d7d7;">#[test]</span>
<span class="linenr">4: </span>    <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">it_works</span>() {
<span class="linenr">5: </span>        <span style="color: #23d7d7;">assert_eq!</span>(2 + 2, 4);
<span class="linenr">6: </span>    }
<span class="linenr">7: </span>}
</pre>
</div>

<ul class="org-ul">
<li>line 1 contains a macro that ensure the following entity to be
compiled only if the "test" target is selected, which is what happens running</li>
<li>line 2 starts a module within this file, this will be compiled only
according to the macro at line 1</li>
<li>line 3 contains a macro which will add some boilerplate code used
to execute the following function and collect its result when
executing tests</li>
<li>line 5 contains a macro checking the two arguments for equality and
then raising an exception if the do not equals
<ul class="org-ul">
<li>equality is defined by a specific trait</li>
<li>if the exception is raised the test is failed</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">cargo test
</pre>
</div>

<ul class="org-ul">
<li>this command also executes all the tests</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcd86a3f" class="outline-3">
<h3 id="orgcd86a3f"><span class="section-number-3">1.2</span> how rust groups code</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9a5ece2" class="outline-4">
<h4 id="org9a5ece2"><span class="section-number-4">1.2.1</span> the code hierarchy</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Rust uses this hierarchical structure
</p>
<pre class="example" id="org0ef1c0c">
+- packages
   |
   +- crates
      |
      +- modules
         |
         +- functions
         |
         +- structures
         |
         +- traits
</pre>
<p>
packages are the highest level: they can be external, built-in
(e.g. <code>std</code>) or user created. Each project defined by a Cargo.toml
is a package
</p>

<p>
Each package can contain a hierarchy of crates, which means they
have the same root and do not have circular dependencies
</p>

<p>
Each crate can contain a hierarchy of modules with possibly
different access permissions
</p>

<p>
actual code is always in the modules
</p>
</div>
</div>
<div id="outline-container-orgf92644c" class="outline-4">
<h4 id="orgf92644c"><span class="section-number-4">1.2.2</span> the crate and modules default</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
when creating a library project with cargo the <code>lib.rs</code> file
contains the code which will be attributed by default to the crate
with the same name as the project
</p>

<p>
all modules are defined by using the <code>mod</code> keyword followed by a
block; modules definition can be nested
</p>

<p>
Modules act as namespace and as incapsulation protection. While
modules on the same file are accessible, their inner objects
should be marked as <code>pub</code> (short for public) to be accessible
</p>
<div class="org-src-container">
<pre class="src src-rust" id="orgc91d01b"><span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">mymodule</span> {
    <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">myfunc</span>(){}
    <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">mysubmodule</span>{
        <span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">myotherfunc</span>(){}
    }
}
</pre>
</div>

<p>
accessing modules from within the same file can be done via a path
</p>
<div class="org-src-container">
<pre class="src src-rust" id="org71d301a"><span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">main</span>(){
    <span style="color: #008b8b;">mymodule</span>::myfunc();
    <span style="color: #008b8b;">mymodule</span>::<span style="color: #008b8b;">mysubmodule</span>::myotherfunc();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9bae1b" class="outline-4">
<h4 id="orgb9bae1b"><span class="section-number-4">1.2.3</span> use keyword and navigating the crate hierarchy</h4>
</div>
</div>

<div id="outline-container-org2715858" class="outline-3">
<h3 id="org2715858"><span class="section-number-3">1.3</span> mixing all together</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org9f6b540" class="outline-4">
<h4 id="org9f6b540"><span class="section-number-4">1.3.1</span> other compilation targets</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
files in the <code>examples</code> and <code>tests</code> are compiled according to the appropriate target   
</p>
<pre class="example" id="orgd08c997">
projectname/
|
+- Cargo.toml
|
+- src/
|  |
|  +- lib.rs
|
+- examples/
|
+- tests/
</pre>

<p>
e.g. the following command
</p>
<div class="org-src-container">
<pre class="src src-bash">cargo build --example mycode
</pre>
</div>

<p>
will compile the file <code>examples/mycode.rs</code>; to run it
</p>
<div class="org-src-container">
<pre class="src src-bash">cargo run --example mycode
</pre>
</div>

<p>
the test command will build and execute also the tests under the
tests directory.
</p>

<p>
But now things starts to be tricky: how can you import the modules in
the src directory in order to test them?
</p>

<p>
the same applies for examples
</p>
</div>
</div>
<div id="outline-container-orgc62433b" class="outline-4">
<h4 id="orgc62433b"><span class="section-number-4">1.3.2</span> accessing the default crate from test files</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
suppose we have the following function in our library
</p>
<div class="org-src-container">
<pre class="src src-rust" id="orgeae9c94"><span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">myfunc</span>(){}
</pre>
</div>

<p>
the crate name is taken from the Cargo.toml name attribute
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffad29; font-weight: bold;">use</span> <span style="color: #008b8b;">rust_blog</span>;
<span style="color: #23d7d7;">#[test]</span>
<span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">test_access_base</span>(){
    <span style="color: #008b8b;">rust_blog</span>::myfunc();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org33ba0d6" class="outline-4">
<h4 id="org33ba0d6"><span class="section-number-4">1.3.3</span> accessing modules from different files</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
the following syntax, added to the lib.rs file is doing two actions:
</p>
<ul class="org-ul">
<li>the mod command search for a file (in this case in the current directory)</li>
<li><p>
the pub modifier re-exports the command
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffad29; font-weight: bold;">pub</span> <span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">poly</span>;
</pre>
</div>

<ul class="org-ul">
<li>this allows to add a test file like the following: note that
this looks for a <code>src/lib.rs</code> which in turn redirects to
<code>src/poly.rs</code> file</li>
</ul>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffad29; font-weight: bold;">use</span> <span style="color: #008b8b;">rust_blog</span>::poly;

<span style="color: #ffad29; font-weight: bold;">mod</span> <span style="color: #008b8b;">test</span> {
    <span style="color: #23d7d7;">#[test]</span>
    <span style="color: #ffad29; font-weight: bold;">fn</span> <span style="color: #00ede1; font-weight: bold;">it_works</span>() {
        <span style="color: #23d7d7;">assert_eq!</span>(2 + 2, 4);
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marco Paolo Valerio Vezzoli</p>
<p class="date">Created: 2021-12-29 Wed 19:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
